*&---------------------------------------------------------------------*
*& Include zsdi_determincao_deposito
*&---------------------------------------------------------------------*
***********************************************************************
*** © 3corações ***
***********************************************************************
*** *
*** DESCRIÇÃO: Tratativa para depósito na venda *
*** AUTOR : Gustavo Santos – Meta *
*** FUNCIONAL: Sandro Seixas  – Meta *
*** DATA : 09/09/2021 *
***********************************************************************
*** HISTÓRICO DAS MODIFICAÇÕES *
***-------------------------------------------------------------------*
*** DATA | AUTOR | DESCRIÇÃO *
***-------------------------------------------------------------------*
*** | | *
***********************************************************************

NEW zclsd_tratativa_deposito_venda(  )->execute( EXPORTING  is_vbak = vbak
                                                            is_vbkd = vbkd
                                                            iv_dwerk = kuwev-dwerk
*                                                            iv_dwerk = rv45a-dwerk
                                                 CHANGING   cs_vbap = vbap ).
