"Name: \TY:CL_SD_SLS_COMP_APM\ME:IGNORE_APM\SE:END\EI
ENHANCEMENT 0 ZEISD_APM_IGNORE.
***********************************************************************
*** © 3corações                                                     ***
***********************************************************************
*** DESCRIÇÃO: GAP BD9 507 - Workflow Flexível                        *
*** AUTOR : Breno Rocha – Meta                                        *
*** FUNCIONAL: Jana Toledo – Meta                                     *
*** DATA : 16/02/2022                                                 *
***********************************************************************
*** HISTÓRICO DAS MODIFICAÇÕES                                        *
***-------------------------------------------------------------------*
*** DATA | AUTOR | DESCRIÇÃO                                          *
***-------------------------------------------------------------------*
*** 16/02/2022 | Breno Rocha | Codigo inicial                         *
***********************************************************************

    INCLUDE zsdi_apm_ignore  IF FOUND.

*  - Fim GAP 507 -----------------------------------------------------

ENDENHANCEMENT.
