***********************************************************************
***                      © 3corações                                ***
***********************************************************************
***                                                                   *
*** DESCRIÇÃO: Adiciona valores de impostos CST60                     *
*** AUTOR    : FLÁVIA LEITE –[META]                                   *
*** FUNCIONAL: JANA TOLEDO –[META]                                    *
*** DATA     : 11.08.2021                                             *
***********************************************************************
*** HISTÓRICO DAS MODIFICAÇÕES                                        *
***-------------------------------------------------------------------*
*** DATA      | AUTOR        | DESCRIÇÃO                              *
***-------------------------------------------------------------------*
***           |              |                                        *
***********************************************************************
    DATA(lo_tax_values) = NEW zclsd_get_tax_values( is_header = is_header it_item = it_nflin it_vbrp = it_vbrp ).
    SORT ct_item BY itmnum.
