***********************************************************************
***                     © 3corações                                 ***
***********************************************************************
***                                                                   *
*** DESCRIÇÃO: Gerar Faturas                                          *
*** AUTOR : Marcos Rubik - META                                       *
*** FUNCIONAL: Jana Toledo de Castilhos - META                        *
*** DATA : 10.09.2021                                                 *
***********************************************************************
*** HISTÓRICO DAS MODIFICAÇÕES                                        *
***-------------------------------------------------------------------*
*** DATA | AUTOR | DESCRIÇÃO                                          *
***-------------------------------------------------------------------*
*** | |                                                               *
***********************************************************************

REPORT zsdr_ger_partidas.

TABLES: nast.
*---------------------------------------------------------------------*
*       FORM ENTRY                                                    *
*---------------------------------------------------------------------*
FORM f_entry USING uv_returncode
                 uv_screen.

  CLEAR : uv_returncode.

  uv_returncode = zclsd_gerar_partidas=>gerar( CONV vbeln_vf( nast-objky ) ).

ENDFORM.
